Revit 2027 API
RebarFreeFormAccessor.HasValidSurfaceServer Method
 Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidSurfaceServer()
Public Function HasValidSurfaceServer As Boolean
public:
bool HasValidSurfaceServer()
member HasValidSurfaceServer : unit -> bool
Return Value
Boolean
 Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace